In [3]:
import pandas as pd
import numpy as np

In [9]:
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,-2,77,78,101]

In [18]:
Gradelist= list(zip(names,grades))

In [19]:
df= pd.DataFrame(Gradelist, columns= ['names','grades'])

In [20]:
df

     names  grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

In [27]:
df[df["grades"]>0]

  names  grades
0   Bob      76
2  Mary      77
3  John      78
4   Mel     101

In [33]:
#changing grades of less than 0 to 0
df.loc[(df["grades"]<0,"grades")]=0

In [34]:
df

     names  grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel     101

In [35]:
df.loc[(df['grades']>=100,'grades')]=100

In [36]:
df

     names  grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel     100